Tekla.Structures.ModelInternal.CustomObject
Represents a class for managing custom objects in the database.

Tekla.Structures.ModelInternal.CustomObject.CustomObjectType
The custom object type name

Tekla.Structures.ModelInternal.CustomObject.CustomObjectCommandName
Represents the command name used to create a custom object.

Tekla.Structures.ModelInternal.CustomObject.StartCustomObjectDM(System.String)
Starts a custom object creation command.
customObjectType: The custom object type.
Returns: True if the command was started successfully; otherwise, false.

Tekla.Structures.ModelInternal.CustomObject.GetCustomObjectTypeAppliedAttributes(Tekla.Structures.Model.ModelObject,System.String)
Gets applied attributes for the custom object type.
modelObject: The model object.
customObjectType: The custom object type.
Returns: Returns the applied attributes of custom object type.

Tekla.Structures.ModelInternal.CustomObject.Insert``1(``0,System.String)
Inserts a custom object into the model database.
The type of the model object.
modelObject: The model object.
customTypeName: The custom type name.
Returns: True if the insertion was successful; otherwise, false.

Tekla.Structures.ModelInternal.CustomObject.FillAppliedAttributes``1(System.Collections.Generic.Dictionary{System.String,System.Object},``0)
Fills object attributes with custom object attributes.
attributes: The attributes for custom object.
modelObject: The custom object instance.

Tekla.Structures.ModelInternal.CustomObject.FillAppliedBoltAttributes``1(System.Collections.Generic.Dictionary{System.String,System.Object},``0)
Fills bolt attributes with custom object attributes.
attributes: The attributes for custom object.
modelObject: The custom object instance.

Tekla.Structures.ModelInternal.CustomObject.FillAppliedWeldAttributes``1(System.Collections.Generic.Dictionary{System.String,System.Object},``0)
Fills weld attributes with custom object attributes.
attributes: The attributes for custom object.
modelObject: The custom object instance.

Tekla.Structures.ModelInternal.CustomObject.SetUserAttributes(System.Collections.Generic.Dictionary{System.String,System.Object},Tekla.Structures.Model.ModelObject)
Sets additional attributes as UDAs from custom object attributes.
attributes: The attributes for custom object.
modelObject: The custom object instance.